Tutorials/Tutorial_case_1_flap/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         pimpleFoam;

startFrom           startTime;
//startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             60.0;

deltaT              0.005;

writeControl        timeStep;

writeInterval       50;

purgeWrite          0;

writeFormat         ascii;

writePrecision      12;

writeCompression    off;

timeFormat          general;

timePrecision       8;

functions
{
    // Function object "KratosOpenfoamAdapterFunctionObject" to couple OpenFOAM with CoSimulation (kratos)
    KratosOpenfoamAdapterFunctionObject1
    {
        type KratosOpenfoamAdapterFunctionObject;
        libs ("../KratosOpenfoamAdapterFunctionObject/libKratosOpenfoamAdapterFunctionObjectFunctionObjects.so");

        interfaces
        {
            Interface1
            {
                name                    interface_flap;
                patches                 (flap);
                importDataIdentifier    (disp_interface_flap);
                exportDataIdentifier    (load_interface_flap);
            }
        }

        parameters
        {
            rho rho [1 -3 0 0 0 0 0] 0.00118;
            nu nu [0 2 -1 0 0 0 0 ] 0.1542;
        }

        dim 3;
        debugLevel info;
    }

    // Function object "CourantNo" to see courant number
    Co1
    {
        type                CourantNo;
        libs                ("libfieldFunctionObjects.so");
        executeControl      timeStep;
        executeInterval     100;
        writeControl        writeTime;
    }

    // Function object "forces" to calcuate the total force on interface
    forces
    {
        type                forces;
        libs                ( "libforces.so" );
        patches             (flap);
        rho                 rhoInf;
        log                 true;
        rhoInf              0.00118;
        CofR                (0 0 0);
        writeControl    timeStep;
        writeInterval   1;
    }

    residuals
    {
        type            residuals;
        libs            ("libutilityFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   100;
        fields          (p U);
    }


    probes
    {
        type            probes;
        libs            ("libsampling.so");

        writeControl    writeTime;     // or timeStep if you want every step
        writeInterval   100;

        fields          (U p);         // add whatever you want to sample

        probeLocations
        (
            (9.45 6.05 0.0)
        );
    }

    writePointDisplacement
    {
        type            writeObjects;
        libs            ("libutilityFunctionObjects.so");

        writeControl    timeStep;
        writeInterval   100;

        objects         (pointDisplacement);
    }


}

// ************************************************************************* //
