Tutorials/Tutorial_case_1_flap/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           1e-5;
        smoother         DICGaussSeidel;
    }

    pFinal
    {
        $p;
        tolerance       1e-07;
        relTol          0;
    }

    pcorr
    {
        solver           GAMG;
        tolerance        1e-5;
        relTol           1e-4;
        smoother         GaussSeidel;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    phi
    {
        $p;
    }

    "(U|cellDisplacement)"
    {

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          1e-6;
    }

    "(U|cellDisplacement)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 5;
    nCorrectors 2;
    nNonOrthogonalCorrectors 5;
    tolerance 1.0e-5;
    relTol 0.01;


    correctPhi          yes;

    consistent  true;

    relaxationFactors
    {
        fields
        {
            p       0.3;
            pFinal  1.0;
            pcorr       0.3;
            pcorrFinal  1.0;
        }
        equations
        {
            U       0.7;
            UFinal  1.0;
        }
    }

    residualControl
    {
        U 1e-5;
        p 1e-5;
        pcorr 1e-5;
    }

}

PISO
{
    nNonOrthogonalCorrectors 5;
}
potentialFlow
{
    nNonOrthogonalCorrectors 5;
}


// ************************************************************************* //